mikeferguson/stm32/projects/etherbotix/main.cpp
        // No need to wait for response
      }
    }

    i += len + 6;
  }

  // Free buffer
  pbuf_free(p);
  ++registers.packets_recv;
}

int udp_interface_init()
{
  eth_udp = udp_new();
  if (eth_udp == NULL)
    return 0;

  if (udp_bind(eth_udp, IP_ADDR_ANY, 6707) != ERR_OK)
    return 0;

  udp_recv(eth_udp, udp_callback, NULL);
  return 1;
}

int main(void)
{
  // TODO save/load register table from flash

  // Setup register table data
  registers.model_number = 301;  // Arbotix was 300
  registers.version = 2;
  registers.id = 253;
  registers.baud_rate = 1;  // 1mbps
  registers.digital_dir = 0;  // all in
  registers.digital_out = 0;
  registers.system_time = last_packet = last_motor_cmd = 0;
  registers.motor_period = 10;  // 10mS period = 100hz
  registers.motor_max_step = 10;
  registers.motor1_kp = registers.motor2_kp = 1.0;
  registers.motor1_kd = registers.motor2_kd = 0;
  registers.motor1_ki = registers.motor2_ki = 0.1;
  registers.motor1_windup = registers.motor2_windup = 400;
  registers.usart3_baud = 34;  // 56700
  registers.usart3_char = 255;  // No terminating character
  registers.packets_recv = registers.packets_bad = 0;

  m1_pid.set_max_step(registers.motor_max_step);
  m1_pid.set_gains(registers.motor1_kp, registers.motor1_kd,
                   registers.motor1_ki, registers.motor1_windup);
  m2_pid.set_max_step(registers.motor_max_step);
  m2_pid.set_gains(registers.motor2_kp, registers.motor2_kd,
                   registers.motor2_ki, registers.motor2_windup);

  NVIC_SetPriorityGrouping(3);

  // Enable GPIO
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;

  act::mode(GPIO_OUTPUT);
  error::mode(GPIO_OUTPUT);
  error::high();  // Hold error high during setup

  // Setup ethernet
  setup_gpio_ethernet();

  // Setup serial
  RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN | RCC_AHB1ENR_DMA2EN;
  RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
  usart1_tx::mode(GPIO_ALTERNATE | GPIO_AF_USART1);
  usart1_rx::mode(GPIO_ALTERNATE | GPIO_AF_USART1);
  NVIC_SetPriority(USART1_IRQn, 1);
  NVIC_EnableIRQ(USART1_IRQn);
  RCC->APB1ENR |= RCC_APB1ENR_USART2EN;
  usart2_tx::mode(GPIO_ALTERNATE | GPIO_AF_USART2);
  usart2_rx::mode(GPIO_ALTERNATE | GPIO_AF_USART2);
  NVIC_SetPriority(USART2_IRQn, 1);
  NVIC_EnableIRQ(USART2_IRQn);
  set_dynamixel_baud(registers.baud_rate);

  // Setup motors
  RCC->APB2ENR |= RCC_APB2ENR_TIM1EN | RCC_APB2ENR_TIM8EN;
  m1_pwm::mode(GPIO_ALTERNATE | GPIO_AF_TIM1);
  m2_pwm::mode(GPIO_ALTERNATE | GPIO_AF_TIM8);
  m1.init(17, 1024);  // actually 16.7kHz, 10-bit resolution
  m2.init(17, 1024);

  // Setup encoders
  RCC->APB1ENR |= RCC_APB1ENR_TIM3EN | RCC_APB1ENR_TIM4EN;
  m1_enc_a::mode(GPIO_ALTERNATE | GPIO_AF_TIM4);
  m1_enc_b::mode(GPIO_ALTERNATE | GPIO_AF_TIM4);
  m2_enc_a::mode(GPIO_ALTERNATE | GPIO_AF_TIM3);
  m2_enc_b::mode(GPIO_ALTERNATE | GPIO_AF_TIM3);
  m1_enc.init();
  m2_enc.init();

  // Setup IMU
  imu.init(100000);
  imu.use_magnetometer(true);

  // Setup analog
  RCC->APB2ENR |= RCC_APB2ENR_ADC1EN | RCC_APB2ENR_ADC2EN | RCC_APB2ENR_ADC3EN;
  adc1.init(VOLTAGE_ANALOG_CHANNEL,
            SERVO_CURRENT_ANALOG_CHANNEL,
            AUX_CURRENT_ANALOG_CHANNEL,
            A0_ANALOG_CHANNEL);
  adc2.init(M1_CURRENT_ANALOG_CHANNEL,
            M2_CURRENT_ANALOG_CHANNEL,
            A1_ANALOG_CHANNEL,
            A2_ANALOG_CHANNEL);  // TODO: set trigger on motor timer
  voltage_sense::mode(GPIO_INPUT_ANALOG);
  servo_sense::mode(GPIO_INPUT_ANALOG);
  adc1.setSampleTime(SERVO_CURRENT_ANALOG_CHANNEL, ADC_SampleTime_84Cycles);
  aux_sense::mode(GPIO_INPUT_ANALOG);
  adc1.setSampleTime(AUX_CURRENT_ANALOG_CHANNEL, ADC_SampleTime_84Cycles);
  m1_sense::mode(GPIO_INPUT_ANALOG);
  m2_sense::mode(GPIO_INPUT_ANALOG);

  // Initialize IO pins (including analog)
  user_io_init();

  // Setup systick
  SysTick_Config(SystemCoreClock/1000);

  LwIP_Init();
  if (!udp_interface_init())
    while(1);

  __enable_irq();
  error::low();  // Done with setup

  while(1)
  {
    LwIP_Periodic_Handle(registers.system_time);

    if (imu.update(registers.system_time))
    {
      registers.accel_x = imu.accel_data.x;
      registers.accel_y = imu.accel_data.y;
      registers.accel_z = imu.accel_data.z;

      registers.gyro_x = imu.gyro_data.x;
      registers.gyro_y = imu.gyro_data.y;
      registers.gyro_z = imu.gyro_data.z;

      registers.mag_x = imu.mag_data.x;
      registers.mag_y = imu.mag_data.y;
      registers.mag_z = imu.mag_data.z;
    }
    registers.imu_flags = imu.get_flags();

    if (user_io_usart3_active_ && registers.usart3_char != 255)
    {
      while (1)
      {
        // Attempt to read from usart3 and forward packet
        int32_t c = usart3.read();

        if (c >= 0)
          usart3_string[usart3_len+5] = c;
        else
          break;

        usart3_len++;

        if (c == registers.usart3_char)
        {
          // Send return string
          usart3_string[0] = 0xff;
          usart3_string[1] = 0xff;
          usart3_string[2] = 253; // id
          usart3_string[3] = usart3_len+2; // len
          usart3_string[4] = 0;  // error
          uint8_t checksum = 0;
          for (int i = 2; i < usart3_len+5; i++)
            checksum += usart3_string[i];
          usart3_string[5+usart3_len] = 255 - checksum;
          udp_send_packet(usart3_string, usart3_len+6, usart3_port);
          usart3_len = 0;
        }
        else if (usart3_len > 192)
        {
          // going to overflow, reset
          usart3_len = 0;
        }
      }
    }
  }
}

extern "C"
{

void SysTick_Handler(void)
{
  ++registers.system_time;

  // Get system voltage in 0.1V increment:
  //   adc is 12 bit (4096 count) spread over 3.3V
  //   voltage divider is 15k/1k
  registers.system_voltage = (adc1.get_channel1()/4096.0f) * 3.3f * 16 * 10;

  // Get aux/servo currents in mA:
  //   ACS711: vcc/2 = 0A, 55mV/A
  registers.servo_current = ((adc1.get_channel2()-2048.0f)/4096.0f) * 3.3f / 0.055f * 1000;
  registers.aux_current = ((adc1.get_channel3()-2048.0f)/4096.0f) * 3.3f / 0.055f * 1000;

  // Analog channels
  registers.a0 = (registers.digital_dir & (1<<0)) ? 0 : adc1.get_channel4();
  registers.a1 = (registers.digital_dir & (1<<1)) ? 0 : adc2.get_channel3();
  registers.a2 = (registers.digital_dir & (1<<2)) ? 0 : adc2.get_channel4();

  // Motor current sense channels
  registers.motor1_current = adc2.get_channel1();
  registers.motor2_current = adc2.get_channel2();

  // Update motors
  if (registers.system_time % registers.motor_period == 0)
  {
    // Update table with position/velocity
    registers.motor1_pos = m1_enc.read();
    registers.motor2_pos = m2_enc.read();
    registers.motor1_vel = m1_enc.read_speed();
    registers.motor2_vel = m2_enc.read_speed();

    if (registers.system_time - last_motor_cmd < 250)
    {
      // Update PID and set motor commands
      m1.set(m1_pid.update_pid(registers.motor1_vel));
      m2.set(m2_pid.update_pid(registers.motor2_vel));
    }
    else
    {
      // Motor commands have timed out
      m1.set(0);
      m2.set(0);
      m1_pid.reset();
      m2_pid.reset();
    }
  }

  // Toggle LED
  if (registers.system_time - last_packet < 500)
  {
    if (registers.system_time % 200 == 0)
      act::high();
    else if (registers.system_time % 100 == 0)
      act::low();
  }
  else
  {
    act::low();
  }

  // Start next conversion of voltage/current
  adc1.convert();
  adc2.convert();
}

// Turn around the rs-485 bus
void USART1_IRQHandler(void)
{
  usart1.usartIrqHandler();
}

// Turn around the ax/mx bus
void USART2_IRQHandler(void)
{
  usart2.usartIrqHandler();
}

}
